  # Challenge

  ## Identifying Outliers using Standard Deviation

In [1]:
# initial imports
import pandas as pd
import numpy as np
import random
from sqlalchemy import create_engine

In [2]:
# create a connection to the database
#engine = create_engine("postgresql://postgres:postgres@localhost:5432/fraud_detection")

In [3]:
engine = create_engine("postgresql://postgres:Tx003677@localhost:5432/TransDB")

In [4]:
# code a function to identify outliers based on standard deviation
query = "SELECT t.id, t.date, t.amount, cc.id_card_holder FROM transaction as t INNER JOIN credit_card as cc ON t.card = cc.card;"

transaction_df = pd.read_sql(query, engine)

transaction_df.head()

     id                date  amount  id_card_holder
0   222 2018-01-01 21:35:10    6.22              13
1  2045 2018-01-01 21:43:12    3.83              13
2   395 2018-01-01 22:41:21    9.61              10
3  3309 2018-01-01 23:13:30   19.03               4
4   567 2018-01-01 23:15:10    2.95              18

In [11]:
transaction_df.sort_values("id_card_holder", axis = 0, ascending = True, 
                 inplace = True, na_position ='last')

transaction_df

        id                date  amount  id_card_holder
3164  1947 2018-11-25 01:27:57    2.99               1
731   1576 2018-03-14 13:39:02   11.33               1
2240  3177 2018-08-18 03:12:40   20.07               1
667   2030 2018-03-09 00:31:16    3.63               1
3200   527 2018-11-29 04:05:12    3.23               1
...    ...                 ...     ...             ...
3086   628 2018-11-15 14:17:09    1.89              25
719   2009 2018-03-12 17:16:34    3.08              25
1364  3342 2018-05-19 09:12:20    2.27              25
2689   333 2018-10-06 19:14:02    4.23              25
1989  2425 2018-07-22 01:03:31    1.20              25

[3500 rows x 4 columns]

In [ ]:
# Cal std diviation of the whole, then standard diviation of each id_card_holder?

In [8]:
# find anomalous transactions for 3 random card holders

  ## Identifying Outliers Using Interquartile Range

In [ ]:
# code a function to identify outliers based on interquartile range
#25 75 method

In [ ]:
# find anomalous transactions for 3 random card holders